package Сlasswork.Work260820;

public class Enum1 {

    /**
     * Задание 1
     * Создайте проект, используя IntelliJ IDEA.
     * Создайте перечислительный тип (enum) Vehicles, содержащий конструктор, который должен принимать целочисленное
     * значение (стоимость автомобиля), содержать метод getColor(), который возвращает строку с цветом автомобиля,
     * и содержать перегружен н ый метод toString(), который должен возвращать строку с названием экземпляра, цветом
     * и стоимостью автомобиля.
     */

    public static void main(String[] args) {
//        Vehicles car1 = Vehicles.AUDI();
//        System.out.println(car1);

        Vehicles car2 = Vehicles.BMW;
        System.out.println(car2);

    }
}
